In [14]:
import pandas as pd

In [16]:
db_books = pd.read_csv("E:/Data Science Study/DAU Machine Learning LAB Work/data-scraping-using-scrapy-and-data-preprocessing-harshpatel080503/assignment_01_Scraper/books.csv")

In [32]:
print("Books Dataset :-\n",db_books.head())

Books Dataset :-
                                    Title   Price Rating Books Available  \
0                   A Light in the Attic  £51.77  Three        In stock
1                     Tipping the Velvet  £53.74    One        In stock
2                             Soumission  £50.10    One        In stock
3                          Sharp Objects  £47.82   Four        In stock
4  Sapiens: A Brief History of Humankind  £54.23   Five        In stock

                                           Image URL
0  media/cache/2c/da/2cdad67c44b002e7ead0cc35693c...
1  media/cache/26/0c/260c6ae16bce31c8f8c95daddd9f...
2  media/cache/3e/ef/3eef99c9d9adef34639f51066202...
3  media/cache/32/51/3251cf3a3412f53f339e42cac213...
4  media/cache/be/a5/bea5697f2534a2f86a3ef27b5a8c...

In [33]:
db_books.rename(columns={
    'available_stocks': 'Books Available',
    'image_url': 'Image URL',
    'price': 'Price',
    'rating': 'Rating',
    'title': 'Title',
}, inplace=True)

In [34]:
print("Books Dataset :-\n",db_books.head())

Books Dataset :-
                                    Title   Price Rating Books Available  \
0                   A Light in the Attic  £51.77  Three        In stock
1                     Tipping the Velvet  £53.74    One        In stock
2                             Soumission  £50.10    One        In stock
3                          Sharp Objects  £47.82   Four        In stock
4  Sapiens: A Brief History of Humankind  £54.23   Five        In stock

                                           Image URL
0  media/cache/2c/da/2cdad67c44b002e7ead0cc35693c...
1  media/cache/26/0c/260c6ae16bce31c8f8c95daddd9f...
2  media/cache/3e/ef/3eef99c9d9adef34639f51066202...
3  media/cache/32/51/3251cf3a3412f53f339e42cac213...
4  media/cache/be/a5/bea5697f2534a2f86a3ef27b5a8c...

In [23]:
db_books.drop(columns = ['availability'], inplace=True)

In [24]:
db_books.head()

,Books Available,Image URL,Price,Rating,Title
0,In stock,media/cache/2c/da/2cdad67c44b002e7ead0cc35693c...,£51.77,Three,A Light in the Attic
1,In stock,media/cache/26/0c/260c6ae16bce31c8f8c95daddd9f...,£53.74,One,Tipping the Velvet
2,In stock,media/cache/3e/ef/3eef99c9d9adef34639f51066202...,£50.10,One,Soumission
3,In stock,media/cache/32/51/3251cf3a3412f53f339e42cac213...,£47.82,Four,Sharp Objects
4,In stock,media/cache/be/a5/bea5697f2534a2f86a3ef27b5a8c...,£54.23,Five,Sapiens: A Brief History of Humankind

In [27]:
db_books = db_books[['Title','Price','Rating','Books Available','Image URL']]

In [28]:
db_books.head()

,Title,Price,Rating,Books Available,Image URL
0,A Light in the Attic,£51.77,Three,In stock,media/cache/2c/da/2cdad67c44b002e7ead0cc35693c...
1,Tipping the Velvet,£53.74,One,In stock,media/cache/26/0c/260c6ae16bce31c8f8c95daddd9f...
2,Soumission,£50.10,One,In stock,media/cache/3e/ef/3eef99c9d9adef34639f51066202...
3,Sharp Objects,£47.82,Four,In stock,media/cache/32/51/3251cf3a3412f53f339e42cac213...
4,Sapiens: A Brief History of Humankind,£54.23,Five,In stock,media/cache/be/a5/bea5697f2534a2f86a3ef27b5a8c...

In [38]:
print("Books Dataset Information :-\n",db_books.info)

Books Dataset Information :-
 <bound method DataFrame.info of                                                  Title   Price Rating  \
0                                 A Light in the Attic  £51.77  Three
1                                   Tipping the Velvet  £53.74    One
2                                           Soumission  £50.10    One
3                                        Sharp Objects  £47.82   Four
4                Sapiens: A Brief History of Humankind  £54.23   Five
..                                                 ...     ...    ...
995  Alice in Wonderland (Alice's Adventures in Won...  £55.53    One
996   Ajin: Demi-Human, Volume 1 (Ajin: Demi-Human #1)  £57.06   Four
997  A Spy's Devotion (The Regency Spies of London #1)  £16.97   Five
998                1st to Die (Women's Murder Club #1)  £53.98    One
999                 1,000 Places to See Before You Die  £26.08   Five

    Books Available                                          Image URL
0          In stock  media/cache/2c/da/2cdad67c44b002e7ead0cc35693c...
1          In stock  media/cache/26/0c/260c6ae16bce31c8f8c95daddd9f...
2          In stock  media/cache/3e/ef/3eef99c9d9adef34639f51066202...
3          In stock  media/cache/32/51/3251cf3a3412f53f339e42cac213...
4          In stock  media/cache/be/a5/bea5697f2534a2f86a3ef27b5a8c...
..              ...                                                ...
995        In stock  ../media/cache/96/ee/96ee77d71a31b7694dac6855f...
996        In stock  ../media/cache/09/7c/097cb5ecc6fb3fbe1690cf0cb...
997        In stock  ../media/cache/1b/5f/1b5ff86f3c75e51e24c573d3f...
998        In stock  ../media/cache/2b/41/2b4161c5b72a4ae386b644682...
999        In stock  ../media/cache/d7/0f/d70f7edd92705c45a82118c3f...

[1000 rows x 5 columns]>

In [39]:
print("Books Dataset Statistics :-\n", db_books.describe())

Books Dataset Statistics :-
                          Title   Price Rating Books Available  \
count                     1000    1000   1000            1000
unique                     999     903      5               1
top     The Star-Touched Queen  £44.18    One        In stock
freq                         2       3    226            1000

                                                Image URL
count                                                1000
unique                                               1000
top     media/cache/2c/da/2cdad67c44b002e7ead0cc35693c...
freq                                                    1

In [57]:
db_books.head()

,Title,Price,Rating,Books Available,Image URL
0,A Light in the Attic,£51.77,Three,In stock,media/cache/2c/da/2cdad67c44b002e7ead0cc35693c...
1,Tipping the Velvet,£53.74,One,In stock,media/cache/26/0c/260c6ae16bce31c8f8c95daddd9f...
2,Soumission,£50.10,One,In stock,media/cache/3e/ef/3eef99c9d9adef34639f51066202...
3,Sharp Objects,£47.82,Four,In stock,media/cache/32/51/3251cf3a3412f53f339e42cac213...
4,Sapiens: A Brief History of Humankind,£54.23,Five,In stock,media/cache/be/a5/bea5697f2534a2f86a3ef27b5a8c...

In [59]:
db_books.isnull()

     Title  Price  Rating  Books Available  Image URL
0    False  False   False            False      False
1    False  False   False            False      False
2    False  False   False            False      False
3    False  False   False            False      False
4    False  False   False            False      False
..     ...    ...     ...              ...        ...
995  False  False   False            False      False
996  False  False   False            False      False
997  False  False   False            False      False
998  False  False   False            False      False
999  False  False   False            False      False

[1000 rows x 5 columns]

In [42]:
db_books.isna().sum()

Title              0
Price              0
Rating             0
Books Available    0
Image URL          0
dtype: int64

In [61]:
db_books.columns = db_books.columns.str.strip()
db_books = db_books.applymap(lambda x: x.strip() if isinstance(x, str) else x)

C:\Users\harsh\AppData\Local\Temp\ipykernel_8768\3865763527.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  db_books = db_books.applymap(lambda x: x.strip() if isinstance(x, str) else x)

In [63]:
db_books['Price'] = db_books['Price'].str.replace('£', '', regex=False).astype(float)

In [65]:
rating_map = {
    'One': 1,
    'Two': 2,
    'Three': 3,
    'Four': 4,
    'Five': 5
}
db_books['Rating'] = db_books['Rating'].map(rating_map)

In [66]:
db_books.head()

,Title,Price,Rating,Books Available,Image URL
0,A Light in the Attic,51.77,3,In stock,media/cache/2c/da/2cdad67c44b002e7ead0cc35693c...
1,Tipping the Velvet,53.74,1,In stock,media/cache/26/0c/260c6ae16bce31c8f8c95daddd9f...
2,Soumission,50.10,1,In stock,media/cache/3e/ef/3eef99c9d9adef34639f51066202...
3,Sharp Objects,47.82,4,In stock,media/cache/32/51/3251cf3a3412f53f339e42cac213...
4,Sapiens: A Brief History of Humankind,54.23,5,In stock,media/cache/be/a5/bea5697f2534a2f86a3ef27b5a8c...

In [67]:
db_books.describe()

            Price       Rating
count  1000.00000  1000.000000
mean     35.07035     2.923000
std      14.44669     1.434967
min      10.00000     1.000000
25%      22.10750     2.000000
50%      35.98000     3.000000
75%      47.45750     4.000000
max      59.99000     5.000000

In [68]:
db_books.describe

<bound method NDFrame.describe of                                                  Title  Price  Rating  \
0                                 A Light in the Attic  51.77       3
1                                   Tipping the Velvet  53.74       1
2                                           Soumission  50.10       1
3                                        Sharp Objects  47.82       4
4                Sapiens: A Brief History of Humankind  54.23       5
..                                                 ...    ...     ...
995  Alice in Wonderland (Alice's Adventures in Won...  55.53       1
996   Ajin: Demi-Human, Volume 1 (Ajin: Demi-Human #1)  57.06       4
997  A Spy's Devotion (The Regency Spies of London #1)  16.97       5
998                1st to Die (Women's Murder Club #1)  53.98       1
999                 1,000 Places to See Before You Die  26.08       5

    Books Available                                          Image URL
0          In stock  media/cache/2c/da/2cdad67c44b002e7ead0cc35693c...
1          In stock  media/cache/26/0c/260c6ae16bce31c8f8c95daddd9f...
2          In stock  media/cache/3e/ef/3eef99c9d9adef34639f51066202...
3          In stock  media/cache/32/51/3251cf3a3412f53f339e42cac213...
4          In stock  media/cache/be/a5/bea5697f2534a2f86a3ef27b5a8c...
..              ...                                                ...
995        In stock  ../media/cache/96/ee/96ee77d71a31b7694dac6855f...
996        In stock  ../media/cache/09/7c/097cb5ecc6fb3fbe1690cf0cb...
997        In stock  ../media/cache/1b/5f/1b5ff86f3c75e51e24c573d3f...
998        In stock  ../media/cache/2b/41/2b4161c5b72a4ae386b644682...
999        In stock  ../media/cache/d7/0f/d70f7edd92705c45a82118c3f...

[1000 rows x 5 columns]>

In [72]:
db_books.drop_duplicates(inplace=True)

In [73]:
db_books.dropna(inplace=True)

In [74]:
db_books.reset_index(drop=True, inplace=True)

In [75]:
db_books.head()

,Title,Price,Rating,Books Available,Image URL
0,A Light in the Attic,51.77,3,In stock,media/cache/2c/da/2cdad67c44b002e7ead0cc35693c...
1,Tipping the Velvet,53.74,1,In stock,media/cache/26/0c/260c6ae16bce31c8f8c95daddd9f...
2,Soumission,50.10,1,In stock,media/cache/3e/ef/3eef99c9d9adef34639f51066202...
3,Sharp Objects,47.82,4,In stock,media/cache/32/51/3251cf3a3412f53f339e42cac213...
4,Sapiens: A Brief History of Humankind,54.23,5,In stock,media/cache/be/a5/bea5697f2534a2f86a3ef27b5a8c...

In [76]:
db_books.describe()

            Price       Rating
count  1000.00000  1000.000000
mean     35.07035     2.923000
std      14.44669     1.434967
min      10.00000     1.000000
25%      22.10750     2.000000
50%      35.98000     3.000000
75%      47.45750     4.000000
max      59.99000     5.000000

In [77]:
db_books.isnull().sum()

Title              0
Price              0
Rating             0
Books Available    0
Image URL          0
dtype: int64

In [78]:
db_books.info

<bound method DataFrame.info of                                                  Title  Price  Rating  \
0                                 A Light in the Attic  51.77       3
1                                   Tipping the Velvet  53.74       1
2                                           Soumission  50.10       1
3                                        Sharp Objects  47.82       4
4                Sapiens: A Brief History of Humankind  54.23       5
..                                                 ...    ...     ...
995  Alice in Wonderland (Alice's Adventures in Won...  55.53       1
996   Ajin: Demi-Human, Volume 1 (Ajin: Demi-Human #1)  57.06       4
997  A Spy's Devotion (The Regency Spies of London #1)  16.97       5
998                1st to Die (Women's Murder Club #1)  53.98       1
999                 1,000 Places to See Before You Die  26.08       5

    Books Available                                          Image URL
0          In stock  media/cache/2c/da/2cdad67c44b002e7ead0cc35693c...
1          In stock  media/cache/26/0c/260c6ae16bce31c8f8c95daddd9f...
2          In stock  media/cache/3e/ef/3eef99c9d9adef34639f51066202...
3          In stock  media/cache/32/51/3251cf3a3412f53f339e42cac213...
4          In stock  media/cache/be/a5/bea5697f2534a2f86a3ef27b5a8c...
..              ...                                                ...
995        In stock  ../media/cache/96/ee/96ee77d71a31b7694dac6855f...
996        In stock  ../media/cache/09/7c/097cb5ecc6fb3fbe1690cf0cb...
997        In stock  ../media/cache/1b/5f/1b5ff86f3c75e51e24c573d3f...
998        In stock  ../media/cache/2b/41/2b4161c5b72a4ae386b644682...
999        In stock  ../media/cache/d7/0f/d70f7edd92705c45a82118c3f...

[1000 rows x 5 columns]>

In [84]:
db_books.to_csv("books_cleaned.csv", index=False)

print("Data cleaned successfully. Shape:", db_books.shape)

Data cleaned successfully. Shape: (1000, 5)